Repository: BeniamCode/medic
Catalog: priv/gettext/*/LC_MESSAGES/default.po
Languages: el

source: Appointments
el: Ραντεβού

source: Browse doctors
el: Περιήγηση γιατρών

source: Dashboard
el: Πίνακας Ελέγχου

source: Every doctor goes through verification so you can focus on care, not paperwork.
el: Κάθε γιατρός περνάει από επαλήθευση ώστε να εστιάζετε στη φροντίδα, όχι στη γραφειοκρατία.

source: Explore Medic's curated network of specialists, compare profiles, and book in seconds with our modern, easy-to-use interface.
el: Εξερευνήστε το δίκτυο ειδικών του Medic, συγκρίνετε προφίλ και κλείστε ραντεβού σε δευτερόλεπτα με τη σύγχρονη, εύχρηστη εφαρμογή μας.

source: Find Doctors
el: Εύρεση Γιατρών

source: Find caring doctors with a
el: Βρείτε γιατρούς που νοιάζονται με μια

source: Friendly follow-ups
el: Φιλικές υπενθυμίσεις

source: Home
el: Αρχική

source: Instant scheduling
el: Άμεσος προγραμματισμός

source: Join as doctor
el: Εγγραφή ως γιατρός

source: Login
el: Σύνδεση

source: Logout
el: Αποσύνδεση

source: Medical Excellence
el: Ιατρική Αριστεία

source: Notifications, reminders, and notes stay in sync with your Medic dashboard.
el: Ειδοποιήσεις, υπενθυμίσεις και σημειώσεις παραμένουν συγχρονισμένες στον πίνακα ελέγχου του Medic.

source: On Duty Hospitals Today
el: Εφημερεύοντα Νοσοκομεία Σήμερα

source: Pick an appointment slot straight from each doctor's profile.
el: Επιλέξτε ώρα ραντεβού απευθείας από το προφίλ κάθε γιατρού.

source: Profile
el: Προφίλ

source: Schedule
el: Πρόγραμμα

source: Settings
el: Ρυθμίσεις

source: Sign In
el: Σύνδεση

source: Sign Out
el: Αποσύνδεση

source: Sign Up
el: Εγγραφή

source: Verified specialists
el: Πιστοποιημένοι ειδικοί

source: close
el: κλείσιμο

source: experience
el: εμπειρία

source: premium
el: κορυφαία

source: About Dr.
el: Σχετικά με τον/την Δρ.

source: Active filters:
el: Ενεργά φίλτρα:

source: All Cities
el: Όλες οι Πόλεις

source: All Specialties
el: Όλες οι Ειδικότητες

source: Any
el: Οποιοδήποτε

source: Any rating
el: Οποιαδήποτε βαθμολογία

source: Are You a Doctor?
el: Είστε Γιατρός;

source: Awards & Recognition
el: Βραβεία & Αναγνώριση

source: Back to search
el: Πίσω στην αναζήτηση

source: Board Certifications
el: Πιστοποιήσεις

source: Book an Appointment
el: Κλείστε Ραντεβού

source: Booked via Medic
el: Κρατήσεις μέσω Medic

source: Choose Time
el: Επιλέξτε Ώρα

source: City
el: Πόλη

source: Clear All Filters
el: Καθαρισμός Όλων

source: Clear all
el: Καθαρισμός όλων

source: Clear all filters
el: Καθαρισμός όλων των φίλτρων

source: Clinical Expertise
el: Κλινική Εμπειρία

source: Common Procedures
el: Συχνές Διαδικασίες

source: Conditions Treated
el: Παθήσεις που Αντιμετωπίζονται

source: Confirm
el: Επιβεβαίωση

source: Consultation Fee:
el: Κόστος Επίσκεψης:

source: Credentials & Research
el: Διαπιστευτήρια & Έρευνα

source: Departments
el: Τμήματα

source: Doctor Registration
el: Εγγραφή Γιατρού

source: Filters
el: Φίλτρα

source: Find the doctor you need by specialty, body part, or location
el: Βρείτε τον γιατρό που χρειάζεστε ανά ειδικότητα, σημείο σώματος ή τοποθεσία

source: Find the right
el: Βρείτε τον κατάλληλο

source: Found
el: Βρέθηκαν

source: From our users
el: Από τους χρήστες μας

source: Get confirmation and reminders for your appointment
el: Λάβετε επιβεβαίωση και υπενθυμίσεις για το ραντεβού σας

source: Highest Rated
el: Υψηλότερη Βαθμολογία

source: How It Works
el: Πώς Λειτουργεί

source: Insurance
el: Ασφάλεια

source: Join the Medic network and increase your visibility
el: Γίνετε μέλος του δικτύου Medic και αυξήστε την προβολή σας

source: Languages Spoken:
el: Γλώσσες:

source: Load more results
el: Φόρτωση περισσότερων

source: Location
el: Τοποθεσία

source: Max Price
el: Μέγιστη Τιμή

source: Most Reviews
el: Περισσότερες Κριτικές

source: Next available: Tomorrow
el: Επόμενο διαθέσιμο: Αύριο

source: Next:
el: Επόμενο:

source: No doctors found
el: Δεν βρέθηκαν γιατροί

source: No results found
el: Δεν βρέθηκαν αποτελέσματα

source: On Call
el: Σε Εφημερία

source: Online Booking
el: Online Κράτηση

source: Popular Specialties
el: Δημοφιλείς Ειδικότητες

source: Price: High to Low
el: Τιμή: Υψηλή προς Χαμηλή

source: Price: Low to High
el: Τιμή: Χαμηλή προς Υψηλή

source: Rating
el: Αξιολόγηση

source: Reg:
el: Αρ. Μητρώου:

source: Search
el: Αναζήτηση

source: Search among hundreds of specialized doctors and book your appointment instantly.
el: Αναζητήστε ανάμεσα σε εκατοντάδες εξειδικευμένους γιατρούς και κλείστε το ραντεβού σας άμεσα.

source: Search by doctor, specialty, or body part...
el: Αναζήτηση ανά γιατρό, ειδικότητα ή μέρος του σώματος...

source: Search by name, specialty, or body part...
el: Αναζήτηση ανά όνομα, ειδικότητα ή μέρος του σώματος...

source: Searching...
el: Αναζήτηση...

source: See real-time availability and pick a convenient time slot
el: Δείτε τη διαθεσιμότητα σε πραγματικό χρόνο και επιλέξτε την ώρα που σας βολεύει

source: Select a time that works for you
el: Επιλέξτε την ώρα που σας εξυπηρετεί

source: Selected Publications
el: Επιλεγμένες Δημοσιεύσεις

source: Sort by
el: Ταξινόμηση κατά

source: Specialized Focus
el: Εξειδικευμένη Εστίαση

source: Specialty
el: Ειδικότητα

source: Verified
el: Πιστοποιημένος

source: Verified Only
el: Μόνο Πιστοποιημένοι

source: Verified Profile
el: Πιστοποιημένο Προφίλ

source: Verified Reviews
el: Πιστοποιημένες Κριτικές

source: Video Available
el: Διαθέσιμη Βιντεοκλήση

source: Video Visit
el: Επίσκεψη Βίντεο

source: View Profile
el: Προβολή Προφίλ

source: We couldn't find any doctors matching your current filters. Try adjusting your search terms or removing some filters.
el: Δεν μπορέσαμε να βρούμε γιατρούς με τα τρέχοντα φίλτρα. Δοκιμάστε να αλλάξετε τους όρους αναζήτησης ή να αφαιρέσετε μερικά φίλτρα.

source: Years Exp.
el: Χρόνια Εμπειρίας

source: for you
el: για εσάς

source: initial visit
el: αρχική επίσκεψη

source: New: Telemedicine Support
el: Νέο: Υποστήριξη Τηλεϊατρικής

source: Modern healthcare for
el: Σύγχρονη υγειονομική περίθαλψη για

source: everyone
el: όλους

source: Book appointments with trusted doctors, manage your visits, and take control of your health journey.
el: Κλείστε ραντεβού με έμπιστους γιατρούς, διαχειριστείτε τις επισκέψεις σας και πάρτε τον έλεγχο της υγείας σας.

source: Join as Patient
el: Εγγραφή ως Ασθενής

source: Trusted by 10,000+ patients
el: Το εμπιστεύονται 10.000+ ασθενείς

source: Easy Search
el: Εύκολη Αναζήτηση

source: Find specialists by name, specialty, or location instantly.
el: Βρείτε ειδικούς με όνομα, ειδικότητα ή τοποθεσία άμεσα.

source: Instant Booking
el: Άμεση Κράτηση

source: Real-time availability means no more phone tag.
el: Διαθεσιμότητα σε πραγματικό χρόνο, τέλος στην αναμονή.

source: Verified Doctors
el: Πιστοποιημένοι Γιατροί

source: Every specialist is vetted for license and quality.
el: Κάθε ειδικός ελέγχεται για την άδεια και την ποιότητα.

source: Telemedicine
el: Τηλεϊατρική

source: Connect with doctors from the comfort of your home.
el: Συνδεθείτε με γιατρούς από την άνεση του σπιτιού σας.

source: Are you a doctor?
el: Είστε γιατρός;

source: Join our network of verified specialists and grow your practice.
el: Γίνετε μέλος του δικτύου πιστοποιημένων ειδικών και αναπτύξτε το ιατρείο σας.

source: Join Medic Network
el: Γίνετε μέλος του Medic

source: Book appointments with trusted doctors, manage your visits, and take control of your health journey—all in one place.
el: Κλείστε ραντεβού με έμπιστους γιατρούς, διαχειριστείτε τις επισκέψεις σας και πάρτε τον έλεγχο της υγείας σας—όλα σε ένα μέρος.

source: Are you a qualified doctor?
el: Είστε εξειδικευμένος γιατρός;

source: Join our network of over 600 verified specialists. specific tools to manage your schedule and grow your practice.
el: Γίνετε μέλος του δικτύου μας με πάνω από 600 πιστοποιημένους ειδικούς. Εργαλεία για τη διαχείριση του προγράμματός σας και την ανάπτυξη του ιατρείου σας.

source: Doctor
el: Γιατρός

source: Dr.
el: Δρ.

source: General Practitioner
el: Γενικός Ιατρός

source: Ask
el: Ρωτήστε

source: Search doctors...
el: Αναζήτηση γιατρών...

source: List
el: Λίστα

source: Map
el: Χάρτης

source: {{count}} doctors found
el: Βρέθηκαν {{count}} γιατροί

source: All specialties
el: Όλες οι ειδικότητες

source: All
el: Όλα

source: All cities
el: Όλες οι πόλεις

source: Telemedicine only
el: Μόνο τηλεϊατρική

source: Show {{count}} results
el: Προβολή {{count}} αποτελεσμάτων

source: Search doctors, clinics, specialties, etc.
el: Αναζήτηση γιατρών, κλινικών, ειδικοτήτων κ.λπ.

source: Select specialty
el: Επιλογή ειδικότητας

source: Select city
el: Επιλογή πόλης

source: Telemedicine available
el: Διαθέσιμη τηλεϊατρική

source: Only show doctors offering telehealth
el: Εμφάνιση μόνο γιατρών που προσφέρουν τηλεϊατρική

source: Less filters
el: Λιγότερα φίλτρα

source: More filters
el: Περισσότερα φίλτρα

source: Select insurance
el: Επιλογή ασφάλειας

source: Max price
el: Μέγιστη τιμή

source: Any price
el: Οποιαδήποτε τιμή

source: Clear filters
el: Καθαρισμός φίλτρων

source: {{count}} specialists found
el: Βρέθηκαν {{count}} ειδικοί

source: Sort by: Best Match
el: Ταξινόμηση: Καλύτερη Αντιστοίχιση

source: Try adjusting your filters
el: Δοκιμάστε να προσαρμόσετε τα φίλτρα σας

source: Medical Specialist
el: Ιατρικός Ειδικός

source: {{count}}+ years
el: {{count}}+ χρόνια

source: Consultation
el: Επίσκεψη

source: Book Now
el: Κλείστε Τώρα

source: Book
el: Κράτηση

source: Visit Type
el: Τύπος Επίσκεψης

source: Clinic
el: Κλινική

source: Video
el: Βίντεο

source: Select Date
el: Επιλογή Ημερομηνίας

source: Available Slots
el: Διαθέσιμα Ραντεβού

source: No available slots
el: Δεν υπάρχουν διαθέσιμα ραντεβού

source: Reason for visit (optional)...
el: Λόγος επίσκεψης (προαιρετικό)...

source: Confirm Booking
el: Επιβεβαίωση Κράτησης

source: No payment required to book
el: Δεν απαιτείται πληρωμή για την κράτηση

source: Biography
el: Βιογραφικό

source: No biography available.
el: Δεν υπάρχει διαθέσιμο βιογραφικό.

source: Special Interests
el: Ειδικά Ενδιαφέροντα

source: Procedures
el: Διαδικασίες

source: Practice Address
el: Διεύθυνση Ιατρείου

source: Affiliation
el: Συνεργασία

source: Map View
el: Προβολή Χάρτη

source: About
el: Σχετικά

source: About & Expertise
el: Σχετικά & Εμπειρία

source: Medical Expertise
el: Ιατρική Εμπειρία

source: Interactive Map
el: Διαδραστικός Χάρτης

source: Get Directions
el: Λήψη Οδηγιών

source: Appreciated by {{count}} patients
el: Εκτιμήθηκε από {{count}} ασθενείς

source: +{{count}} in last 30 days
el: +{{count}} τις τελευταίες 30 ημέρες

source: {{count}}+ Years Exp.
el: {{count}}+ Χρόνια Εμπειρίας

source: Clinic Visit
el: Επίσκεψη στο Ιατρείο

source: Video Call
el: Βιντεοκλήση

source: No available slots for this date.
el: Δεν υπάρχουν διαθέσιμα ραντεβού για αυτήν την ημερομηνία.

source: No payment required to book.
el: Δεν απαιτείται πληρωμή για την κράτηση.

source: Good morning, Dr. {{lastName}}
el: Καλημέρα, Δρ. {{lastName}}

source: Today
el: Σήμερα

source: Pending
el: Εκκρεμείς

source: This Week
el: Αυτήν την Εβδομάδα

source: Today's Schedule
el: Το Πρόγραμμα της Ημέρας

source: No appointments today
el: Δεν υπάρχουν ραντεβού σήμερα

source: Manage Availability
el: Διαχείριση Διαθεσιμότητας

source: Edit Profile
el: Επεξεργασία Προφίλ

source: Doctor Dashboard
el: Πίνακας Ελέγχου Γιατρού

source: appointments
el: ραντεβού

source: Pending requests
el: Εκκρεμή αιτήματα

source: Action required
el: Απαιτείται ενέργεια

source: Confirmed (week)
el: Επιβεβαίωση (εβδ.)

source: upcoming visits
el: επερχόμενες επισκέψεις

source: reviews
el: κριτικές

source: Quick Actions
el: Γρήγορες Ενέργειες

source: Analytics (coming soon)
el: Αναλυτικά (σύντομα)

source: In-person
el: Δια ζώσης

source: Unknown
el: Άγνωστος

source: Phone
el: Τηλέφωνο

source: Patient message
el: Μήνυμα ασθενούς

source: No message provided
el: Δεν παρεχέθηκε μήνυμα

source: Patient
el: Ασθενής

source: Time
el: Ώρα

source: Mode
el: Τρόπος

source: Status
el: Κατάσταση

source: Awaiting patient approval
el: Αναμονή έγκρισης ασθενούς

source: Expires
el: Λήγει

source: Actions
el: Ενέργειες

source: Approve this appointment?
el: Έγκριση αυτού του ραντεβού;

source: Approve
el: Έγκριση

source: Awaiting patient decision
el: Αναμονή απόφασης ασθενούς

source: Reschedule
el: Επαναπρογραμματισμός

source: Reject
el: Απόρριψη

source: Pending approval
el: Εκκρεμεί έγκριση

source: Upcoming
el: Επερχόμενα

source: Completed
el: Ολοκληρωμένα

source: Total
el: Σύνολο

source: Practice
el: Ιατρείο

source: Approve, reschedule, or cancel your visits
el: Εγκρίνετε, επαναπρογραμματίστε ή ακυρώστε τις επισκέψεις σας

source: Cancelled
el: Ακυρωμένα

source: Add a short reason for the patient
el: Προσθέστε σύντομη αιτιολογία για τον ασθενή

source: Example: prefer earlier in the day
el: Παράδειγμα: προτιμώ νωρίτερα μέσα στην ημέρα

source: Pick a new slot to propose
el: Επιλέξτε νέο ραντεβού για πρόταση

source: Add a note for the patient (optional)
el: Προσθέστε σημείωση για τον ασθενή (προαιρετικό)

source: Send reschedule request
el: Αποστολή αιτήματος επαναπρογραμματισμού

source: Manage Schedule
el: Διαχείριση Προγράμματος

source: Set your recurring weekly availability.
el: Ορίστε την επαναλαμβανόμενη εβδομαδιαία διαθεσιμότητά σας.

source: Reset Schedule
el: Επαναφορά Προγράμματος

source: Edit Availability
el: Επεξεργασία Διαθεσιμότητας

source: Weekly Hours
el: Εβδομαδιαίες Ώρες

source: Time Off & Holidays
el: Άδειες & Αργίες

source: Add
el: Προσθήκη

source: No availability slots for this day.
el: Δεν υπάρχουν ραντεβού διαθεσιμότητας για αυτήν την ημέρα.

source: min
el: λεπ

source: Day Off
el: Ρεπό

source: No time off scheduled
el: Δεν έχουν προγραμματιστεί άδειες

source: Reason
el: Αιτία

source: Holiday
el: Αργία

source: Vacation
el: Διακοπές

source: Personal
el: Προσωπικά

source: Conference
el: Συνέδριο

source: Other
el: Άλλο

source: Cancel
el: Ακύρωση

source: Save
el: Αποθήκευση

source: Upcoming Appointments
el: Επερχόμενα Ραντεβού

source: No upcoming appointments
el: Δεν υπάρχουν επερχόμενα ραντεβού

source: Setup Availability
el: Ρύθμιση Διαθεσιμότητας

source: Preview Slots
el: Προεπισκόπηση Ραντεβού

source: Save availability
el: Αποθήκευση διαθεσιμότητας

source: Consultation Mode
el: Τρόπος Επίσκεψης

source: In-Person
el: Δια Ζώσης

source: Phone Call
el: Τηλεφωνική Κλήση

source: Timezone
el: Ζώνη Ώρας

source: Hours
el: Ώρες

source: Interval
el: Διάστημα

source: Are you sure?
el: Είστε σίγουροι;

source: This will remove ALL your availability rules. Are you sure?
el: Αυτό θα αφαιρέσει ΟΛΟΥΣ τους κανόνες διαθεσιμότητάς σας. Είστε σίγουροι;

source: Yes
el: Ναι

source: No
el: Όχι

source: Single Day
el: Μια Μέρα

source: Date Range
el: Εύρος Ημερομηνιών

source: Date
el: Ημερομηνία

source: European Board Certification
el: Πιστοποίηση Ευρωπαϊκού Συμβουλίου

source: Greek Medical Association
el: Ελληνικός Ιατρικός Σύλλογος

source: American Board Certification
el: Πιστοποίηση Αμερικανικού Συμβουλίου

source: Cardiology
el: Καρδιολογία

source: Dermatology
el: Δερματολογία

source: Orthopedics
el: Ορθοπεδική

source: Endocrinology
el: Ενδοκρινολογία

source: Neurology
el: Νευρολογία

source: MRI Consultation
el: Γνωμάτευση MRI

source: Endoscopy
el: Ενδοσκόπηση

source: Physical Therapy Eval
el: Αξιολόγηση Φυσιοθεραπείας

source: Telemedicine Follow-up
el: Παρακολούθηση Τηλεϊατρικής

source: Hypertension
el: Υπέρταση

source: Diabetes
el: Διαβήτης

source: Back Pain
el: Οσφυαλγία

source: Anxiety
el: Άγχος

source: Skin Allergy
el: Δερματική Αλλεργία

source: Profile saved
el: Το προφίλ αποθηκεύτηκε

source: Unable to save. Please review the highlighted fields.
el: Αδυναμία αποθήκευσης. Παρακαλώ ελέγξτε τα επισημασμένα πεδία.

source: Doctor profile
el: Προφίλ Γιατρού

source: Polish your public profile so patients instantly understand who you are, what you treat, and how to book you.
el: Τελειοποιήστε το δημόσιο προφίλ σας ώστε οι ασθενείς να καταλάβουν αμέσως ποιος είστε, τι θεραπεύετε και πώς να κλείσουν ραντεβού.

source: Visible in search
el: Ορατό στην αναζήτηση

source: Secure data
el: Ασφαλή δεδομένα

source: Profile completeness
el: Πληρότητα προφίλ

source: Complete all sections to unlock premium placements.
el: Ολοκληρώστε όλες τις ενότητες για να ξεκλειδώσετε προνομιακές τοποθετήσεις.

source: Quick actions
el: Γρήγορες ενέργειες

source: Update your public card in one place and preview the patient-facing layout.
el: Ενημερώστε τη δημόσια κάρτα σας σε ένα μέρος και δείτε την προεπισκόπηση όπως θα την βλέπουν οι ασθενείς.

source: basic
el: Βασικά

source: professional
el: Επαγγελματικά

source: location
el: Τοποθεσία

source: expertise
el: Εξειδίκευση

source: Basic info
el: Βασικές πληροφορίες

source: Professional
el: Επαγγελματικά

source: Location & services
el: Τοποθεσία & Υπηρεσίες

source: Expertise
el: Εξειδίκευση

source: Professional photo
el: Επαγγελματική φωτογραφία

source: Please upload a JPG, PNG, or WebP image
el: Παρακαλώ ανεβάστε εικόνα JPG, PNG ή WebP

source: Max file size is 5MB
el: Το μέγιστο μέγεθος αρχείου είναι 5MB

source: No file received. Please try again.
el: Δεν ελήφθη αρχείο. Παρακαλώ δοκιμάστε ξανά.

source: Save your profile first, then upload a photo.
el: Αποθηκεύστε πρώτα το προφίλ σας, μετά ανεβάστε φωτογραφία.

source: Storage is not configured. Set Backblaze B2 env vars and restart the server.
el: Ο χώρος αποθήκευσης δεν έχει ρυθμιστεί. Ορίστε τις μεταβλητές περιβάλλοντος Backblaze B2 και επανεκκινήστε τον διακομιστή.

source: Unable to upload photo. Please try again.
el: Αδυναμία μεταφόρτωσης φωτογραφίας. Παρακαλώ δοκιμάστε ξανά.

source: Photo updated
el: Η φωτογραφία ενημερώθηκε

source: Upload photo
el: Μεταφόρτωση φωτογραφίας

source: Use a clear, front-facing headshot on a neutral background. JPG/PNG/WebP up to 5MB.
el: Χρησιμοποιήστε μια καθαρή, μετωπική φωτογραφία προσώπου σε ουδέτερο φόντο. JPG/PNG/WebP έως 5MB.

source: First name
el: Όνομα

source: Last name
el: Επώνυμο

source: Title
el: Τίτλος

source: Academic title
el: Ακαδημαϊκός τίτλος

source: Profile image URL
el: URL εικόνας προφίλ

source: Registration number
el: Αρ. Μητρώου

source: Years of experience
el: Έτη εμπειρίας

source: Hospital affiliation
el: Νοσοκομειακή συνεργασία

source: Bio (EN)
el: Βιογραφικό (EN)

source: Bio (EL)
el: Βιογραφικό (EL)

source: Certifications
el: Πιστοποιήσεις

source: e.g. European Board of ...
el: π.χ. Ευρωπαϊκό Συμβούλιο...

source: Languages
el: Γλώσσες

source: Select or add languages
el: Επιλέξτε ή προσθέστε γλώσσες

source: Insurance networks
el: Ασφαλιστικά ταμεία

source: Choose accepted networks
el: Επιλέξτε αποδεκτά ταμεία

source: Address
el: Διεύθυνση

source: Area
el: Περιοχή

source: Zip Code
el: Τ.Κ.

source: Location found! You can adjust the pin.
el: Η τοποθεσία βρέθηκε! Μπορείτε να προσαρμόσετε την πινέζα.

source: Address not found.
el: Η διεύθυνση δεν βρέθηκε.

source: Could not fetch location.
el: Αδυναμία εύρεσης τοποθεσίας.

source: Locate on Map
el: Εντοπισμός στο Χάρτη

source: Click to preview, then drag the pin to correct precise location.
el: Κάντε κλικ για προεπισκόπηση, στη συνέχεια σύρετε την πινέζα για ακριβή τοποθεσία.

source: Consultation fee (€)
el: Κόστος επίσκεψης (€)

source: Sub-specialties
el: Εξειδικεύσεις

source: Add focus areas
el: Προσθέστε τομείς εστίασης

source: Clinical procedures
el: Κλινικές διαδικασίες

source: Conditions treated
el: Παθήσεις που αντιμετωπίζονται

source: Doctor Portal
el: Πύλη Γιατρών

source: Sign out
el: Αποσύνδεση

source: Profile progress
el: Πρόοδος Προφίλ

source: welcome
el: Καλωσόρισμα

source: personal
el: Προσωπικά

source: specialty
el: Ειδικότητα

source: pricing
el: Τιμολόγηση

source: complete
el: Ολοκλήρωση

source: Submit profile
el: Υποβολή Προφίλ

source: Let's start
el: Ας Ξεκινήσουμε

source: Continue
el: Συνέχεια

source: Welcome to Medic
el: Καλώς ήρθατε στο Medic

source: Think of this as a guided intro—answer a few friendly questions and we will shape your booking profile.
el: Δείτε αυτό ως μια καθοδηγούμενη εισαγωγή—απαντήστε σε μερικές φιλικές ερωτήσεις και θα φτιάξουμε το προφίλ κρατήσεών σας.

source: Tell us about you
el: Πείτε μας για εσάς

source: A warm introduction helps patients know they are in excellent hands.
el: Μια θερλή εισαγωγή βοηθά τους ασθενείς να γνωρίζουν ότι είναι σε καλά χέρια.

source: First Name
el: Όνομα

source: Last Name
el: Επώνυμο

source: Registration No.
el: Αρ. Μητρώου

source: Experience (Years)
el: Εμπειρία (Έτη)

source: What is your area of expertise?
el: Ποιος είναι ο τομέας εξειδίκευσής σας;

source: Select your specialty
el: Επιλέξτε την ειδικότητά σας

source: Professional Bio
el: Επαγγελματικό Βιογραφικό

source: Share a short paragraph highlighting your style and focus areas.
el: Μοιραστείτε μια σύντομη παράγραφο τονίζοντας το στυλ και τους τομείς εστίασής σας.

source: Where do you meet patients?
el: Πού συναντάτε τους ασθενείς;

source: Street Address
el: Διεύθυνση

source: Offer telemedicine appointments?
el: Προσφέρετε ραντεβού τηλεϊατρικής;

source: Set your consultation fee
el: Ορίστε την αμοιβή επίσκεψης

source: Transparency builds trust—you can always fine-tune later.
el: Η διαφάνεια χτίζει εμπιστοσύνη—μπορείτε πάντα να την προσαρμόσετε αργότερα.

source: Profile ready!
el: Το προφίλ είναι έτοιμο!

source: Next stop: availability. Set your calendar so patients can start booking you right away.
el: Επόμενο βήμα: διαθεσιμότητα. Ορίστε το ημερολόγιό σας ώστε οι ασθενείς να μπορούν να σας κλείσουν ραντεβού αμέσως.

source: Manage availability
el: Διαχείριση διαθεσιμότητας

source: Reschedule approved
el: Ο επαναπρογραμματισμός εγκρίθηκε

source: Something went wrong
el: Κάτι πήγε στραβά

source: You declined this reschedule
el: Απορρίψατε αυτόν τον επαναπρογραμματισμό

source: Reschedule rejected
el: Ο επαναπρογραμματισμός απορρίφθηκε

source: Unable to reject
el: Αδυναμία απόρριψης

source: This will remove your booking.
el: Αυτό θα αφαιρέσει την κράτησή σας.

source: Cancelled by patient
el: Ακυρώθηκε από τον ασθενή

source: Appointment cancelled
el: Το ραντεβού ακυρώθηκε

source: Unable to cancel
el: Αδυναμία ακύρωσης

source: Already appreciated
el: Έχετε ήδη στείλει ευχαριστήριο

source: Thank you!
el: Ευχαριστούμε!

source: Unable to send
el: Αδυναμία αποστολής

source: General practice
el: Γενική ιατρική

source: Review this rescheduled time
el: Ελέγξτε αυτήν την ώρα επαναπρογραμματισμού

source: Confirm if the new time works or choose to reject it.
el: Επιβεβαιώστε εάν η νέα ώρα σας βολεύει ή επιλέξτε να την απορρίψετε.

source: Reject this rescheduled time?
el: Απόρριψη αυτής της ώρας επαναπρογραμματισμού;

source: This booking will be cancelled if you reject.
el: Αυτή η κράτηση θα ακυρωθεί εάν απορρίψετε.

source: Waiting for your doctor to confirm
el: Αναμονή επιβεβαίωσης από τον γιατρό σας

source: Cancel this appointment?
el: Ακύρωση αυτού του ραντεβού;

source: Join Call
el: Συμμετοχή στην Κλήση

source: Book a new appointment
el: Κλείστε νέο ραντεβού

source: Past
el: Παλαιότερα

source: No past appointments
el: Δεν υπάρχουν παλαιότερα ραντεβού

source: Hello, {{name}}
el: Γεια σου, {{name}}

source: Manage your health journey
el: Διαχειριστείτε την υγεία σας

source: Your Appointments
el: Τα Ραντεβού Σας

source: Medical Records
el: Ιατρικό Ιστορικό

source: Get the Medic App
el: Κατεβάστε την εφαρμογή Medic

source: Manage appointments on the go with our mobile app.
el: Διαχειριστείτε τα ραντεβού σας εν κινήσει με την εφαρμογή μας.

source: Download
el: Λήψη

source: Appreciate Doctor
el: Ευχαριστήστε τον Γιατρό

source: Send Appreciation
el: Αποστολή Ευχαριστηρίου

source: Would you like to leave a short thank-you note? (Optional)
el: Θα θέλατε να αφήσετε ένα σύντομο ευχαριστήριο σημείωμα; (Προαιρετικό)

source: e.g. Very kind and caring...
el: π.χ. Πολύ ευγενικός και φροντιστικός...
