Repository: BeniamCode/medic
Catalog: priv/gettext/*/LC_MESSAGES/default.po
Languages: el

source: Appreciation sent!
el: Η ευχαριστία εστάλη!

source: Unable to submit appreciation. Please try again.
el: Αδυναμία υποβολής ευχαριστίας. Παρακαλώ δοκιμάστε ξανά.

source: Unable to save
el: Αδυναμία αποθήκευσης

source: Patient profile
el: Προφίλ ασθενούς

source: Keep your details up to date
el: Κρατήστε τα στοιχεία σας ενημερωμένα

source: Basic Info
el: Βασικές Πληροφορίες

source: Date of birth
el: Ημερομηνία γέννησης

source: Emergency contact
el: Επαφή έκτακτης ανάγκης

source: Preferences
el: Προτιμήσεις

source: Preferred language
el: Προτιμώμενη γλώσσα

source: Preferred timezone
el: Προτιμώμενη ζώνη ώρας

source: Email reminders
el: Υπενθυμίσεις Email

source: SMS reminders
el: Υπενθυμίσεις SMS

source: Save changes
el: Αποθήκευση αλλαγών

source: Private
el: Ιδιωτικό

source: Profile photo
el: Φωτογραφία προφίλ

source: Use a clear photo. JPG/PNG/WebP up to 5MB.
el: Χρησιμοποιήστε μια καθαρή φωτογραφία. JPG/PNG/WebP έως 5MB.

source: Name + phone
el: Όνομα + τηλέφωνο

source: These help us tailor notifications and the experience.
el: Αυτά μας βοηθούν να προσαρμόσουμε τις ειδοποιήσεις και την εμπειρία.

source: Appointment confirmations
el: Επιβεβαιώσεις ραντεβού

source: Appointment confirmations and reminders
el: Επιβεβαιώσεις και υπενθυμίσεις ραντεβού

source: Optional SMS updates
el: Προαιρετικές ενημερώσεις SMS

source: Optional SMS updates when available
el: Προαιρετικές ενημερώσεις SMS όταν είναι διαθέσιμες

source: How was your experience?
el: Πώς ήταν η εμπειρία σας;

source: Your appreciation helps other patients find great care.
el: Η εκτίμησή σας βοηθά άλλους ασθενείς να βρουν εξαιρετική φροντίδα.

source: Your appreciation is anonymous and helps other patients find great care.
el: Η εκτίμησή σας είναι ανώνυμη και βοηθά άλλους ασθενείς να βρουν εξαιρετική φροντίδα.

source: Send
el: Αποστολή

source: Send appreciation
el: Αποστολή εκτίμησης

source: Skip
el: Παράλειψη

source: Appointment details
el: Λεπτομέρειες ραντεβού

source: Notes
el: Σημειώσεις

source: Cancel appointment
el: Ακύρωση ραντεβού

source: Express appreciation
el: Εκφράστε την εκτίμησή σας

source: Optional thank-you note (max 80 characters)
el: Προαιρετικό ευχαριστήριο (μέγ. 80 χαρακτήρες)

source: Account settings
el: Ρυθμίσεις λογαριασμού

source: Manage your profile and preferences
el: Διαχειριστείτε το προφίλ και τις προτιμήσεις σας

source: Role
el: Ρόλος

source: Update profile
el: Ενημέρωση προφίλ

source: Security
el: Ασφάλεια

source: Welcome back
el: Καλώς ήρθατε ξανά

source: Sign in to manage your appointments
el: Συνδεθείτε για να διαχειριστείτε τα ραντεβού σας

source: Email address
el: Διεύθυνση email

source: Please enter your email
el: Παρακαλώ εισάγετε το email σας

source: Password
el: Κωδικός

source: Please enter your password
el: Παρακαλώ εισάγετε τον κωδικό σας

source: Your password
el: Ο κωδικός σας

source: Remember me
el: Να με θυμάσαι

source: Forgot password?
el: Ξεχάσατε τον κωδικό;

source: Sign in
el: Σύνδεση

source: Don't have an account?
el: Δεν έχετε λογαριασμό;

source: Create an account
el: Δημιουργία λογαριασμού

source: Book appointments and manage your health
el: Κλείστε ραντεβού και διαχειριστείτε την υγεία σας

source: Create Patient Account
el: Δημιουργία Λογαριασμού Ασθενούς

source: Register as a Specialist
el: Εγγραφή ως Ειδικός

source: Already have an account?
el: Έχετε ήδη λογαριασμό;

source: Join as a Specialist
el: Εγγραφείτε ως Ειδικός

source: Managing your practice has never been easier
el: Η διαχείριση του ιατρείου σας δεν ήταν ποτέ ευκολότερη

source: Start Application
el: Έναρξη Αίτησης

source: Alerts
el: Ειδοποιήσεις

source: My Schedule
el: Το Πρόγραμμά μου

source: My Profile
el: Το Προφίλ μου

source: Notifications
el: Ειδοποιήσεις

source: Discover
el: Ανακαλύψτε

source: Loading...
el: Φόρτωση...

source: No new notifications
el: Δεν υπάρχουν νέες ειδοποιήσεις

source: just now
el: μόλις τώρα

source: {{count}}m ago
el: πριν {{count}}λ

source: {{count}}h ago
el: πριν {{count}}ω

source: {{count}}d ago
el: πριν {{count}}μ

source: {{count}}w ago
el: πριν {{count}}ε

source: View All Notifications
el: Προβολή Όλων των Ειδοποιήσεων

source: Notification
el: Ειδοποίηση

source: Schedule saved successfully
el: Το πρόγραμμα αποθηκεύτηκε επιτυχώς

source: Failed to save schedule
el: Αποτυχία αποθήκευσης προγράμματος

source: Mon
el: Δευ

source: Tue
el: Τρι

source: Wed
el: Τετ

source: Thu
el: Πεμ

source: Fri
el: Παρ

source: Sat
el: Σαβ

source: Sun
el: Κυρ

source: Add Time Off
el: Προσθήκη Άδειας

source: Back
el: Πίσω

source: doctor.profile.professional
el: Επαγγελματικά

source: doctor.profile.certifications
el: Πιστοποιήσεις

source: doctor.profile.certifications_placeholder
el: π.χ. Ευρωπαϊκό Συμβούλιο...

source: doctor.profile.languages
el: Γλώσσες

source: doctor.profile.languages_placeholder
el: Επιλέξτε ή προσθέστε γλώσσες

source: doctor.profile.insurance
el: Ασφαλιστικά δίκτυα

source: doctor.profile.insurance_placeholder
el: Επιλέξτε αποδεκτά δίκτυα

source: doctor.profile.location
el: Τοποθεσία & υπηρεσίες

source: doctor.profile.location_found
el: Η τοποθεσία βρέθηκε! Μπορείτε να προσαρμόσετε την πινέζα.

source: doctor.profile.location_not_found
el: Η διεύθυνση δεν βρέθηκε.

source: doctor.profile.location_error
el: Αδυναμία εύρεσης τοποθεσίας.

source: doctor.profile.locate
el: Εντοπισμός στο Χάρτη

source: doctor.profile.locate_hint
el: Κάντε κλικ για προεπισκόπηση, και σύρετε την πινέζα για διόρθωση.

source: doctor.profile.telemedicine
el: Διαθέσιμη τηλεϊατρική

source: doctor.profile.expertise
el: Εξειδίκευση

source: doctor.profile.sub_specialties
el: Υποειδικότητες

source: doctor.profile.sub_specialties_placeholder
el: Προσθήκη περιοχών εστίασης

source: doctor.profile.procedures
el: Κλινικές διαδικασίες

source: doctor.profile.conditions
el: Παθήσεις που αντιμετωπίζονται

source: doctor.profile.save
el: Αποθήκευση

source: notifications.title
el: Ειδοποιήσεις

source: notifications.subtitle
el: Μείνετε ενήμεροι

source: notifications.mark_all
el: Σήμανση όλων ως αναγνωσμένα

source: notifications.empty
el: Καμία ειδοποίηση ακόμα

source: notifications.mark_read
el: Σήμανση ως αναγνωσμένο

source: Confirmed
el: Επιβεβαιωμένα

source: Requests
el: Αιτήματα

source: Earlier
el: Νωρίτερα

source: dashboard.patient_fallback
el: παιδί

source: dashboard.already_appreciated
el: Έχετε ήδη ευχαριστήσει για αυτό το ραντεβού

source: dashboard.appreciation_sent
el: Το ευχαριστήριο στάλθηκε!

source: dashboard.appreciation_error
el: Αδυναμία υποβολής ευχαριστηρίου. Παρακαλώ δοκιμάστε ξανά.

source: dashboard.approve_success
el: Ο επαναπρογραμματισμός εγκρίθηκε

source: dashboard.approve_error
el: Κάτι πήγε στραβά. Παρακαλώ δοκιμάστε ξανά.

source: dashboard.reject_success
el: Ο επαναπρογραμματισμός απορρίφθηκε

source: dashboard.reject_error
el: Αδυναμία απόρριψης αυτή τη στιγμή. Παρακαλώ δοκιμάστε ξανά.

source: dashboard.cancel_success
el: Το ραντεβού ακυρώθηκε

source: dashboard.cancel_error
el: Αδυναμία ακύρωσης αυτή τη στιγμή. Παρακαλώ δοκιμάστε ξανά.

source: E.g. Very kind and caring.
el: Π.χ. Πολύ ευγενικός και φροντιστικός.

source: Keep your details up to date so we can personalize your experience and help clinics reach you about appointments.
el: Κρατήστε τα στοιχεία σας ενημερωμένα για να εξατομικεύσουμε την εμπειρία σας και να βοηθήσουμε τις κλινικές να επικοινωνήσουν μαζί σας.

source: John
el: Γιάννης

source: Doe
el: Παπαδόπουλος

source: Change password (coming soon)
el: Αλλαγή κωδικού (σύντομα)

source: Register
el: Εγγραφή

source: Min. 8 characters
el: Ελάχ. 8 χαρακτήρες

source: Are you a patient?
el: Είστε ασθενής;
